{
  "_name_or_path": "./LLaMA_MoE/",
  "add_weight_norm": false,
  "architectures": [
    "LlamaMoEForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_llama_moe.LlamaMoEConfig",
    "AutoModel": "modeling_llama_moe_hf.LlamaMoEModel",
    "AutoModelForCausalLM": "modeling_llama_moe_hf.LlamaMoEForCausalLM"
  },
  "bos_token_id": 0,
  "calculator_type": "UniversalCalculator",
  "capacity_factor": 1.25,
  "drop_tokens": true,
  "dropped_padding": "zero",
  "eos_token_id": 2,
  "gate_add_noise": true,
  "gate_balance_loss_weight": 0.01,
  "gate_network": "mlp",
  "gate_noise_epsilon": 0.01,
  "gate_type": "TopKBalancedNoisyGate",
  "gate_use_balance": true,
  "gate_use_softmax": true,
  "gates": "mlp",
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 65536,
  "max_position_embeddings": 2048,
  "model_type": "llama_moe",
  "multiply_gate_scores": true,
  "num_attention_heads": 16,
  "num_experts": 8,
  "num_hidden_layers": 2,
  "num_key_value_heads": 16,
  "num_selects": 2,
  "pad_token_id": 1,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "score_scale_factor": 4.0,
  "size_experts": [
    [
      8192,
      8192,
      8192,
      8192,
      8192,
      8192,
      8192,
      8192
    ],
    [
      8192,
      8192,
      8192,
      8192,
      8192,
      8192,
      8192,
      8192
    ]
  ],
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.30.2",
  "use_cache": true,
  "vocab_size": 32000
}
